#ifndef DECLARATION_H
#define DECLARATION_H

#include <glm/glm.hpp>

//窗口宽高设置
const unsigned int WINDOW_WIDTH = 800;
const unsigned int WINDOW_HEIGHT = 600;

// 设置立方体定点参数
float vertices[] = {
	//位置                // 颜色
	 0.5f, 0.5f, 0.5f,    1.0f, 0.0f, 0.0f,//正面--右上
	 -0.5f, 0.5f, 0.5f,   0.0f, 1.0f, 0.0f,//正面--左上
	 0.5f, -0.5f, 0.5f,   0.0f, 0.0f, 1.0f,//正面--右下
	 0.5f, 0.5f, -0.5f,   1.0f, 1.0f, 0.0f,//反面--右上
	 -0.5f, -0.5f, 0.5f,  1.0f, 0.0f, 1.0f,//正面--左下
	 -0.5f, 0.5f, -0.5f,  0.0f, 1.0f, 1.0f,//反面--左上
	 0.5f, -0.5f, -0.5f,  1.0f, 1.0f, 1.0f,//反面--右下
	 -0.5f, -0.5f, -0.5f, 0.0f, 0.0f, 0.0f //反面--左下
};

//设置索引缓冲对象--三角形
unsigned int index_d[] = {
	0, 1, 2, //正面--右上
	1, 2, 4, //正面--左下
	0, 1, 3, //上面--右下
	1, 3, 5, //上面--左上
	2, 4, 6, //下面--右上
	4, 6, 7, //下面--左下
	0, 2, 3, //右面--左上
	2, 3, 6, //右面--右下
	1, 4, 5, //左面--右上
	4, 5, 7, //左面--左下
	3, 5, 6, //背面--左上
	5, 6, 7  //背面--右下
};

#endif
